// מהתרגיל SHOP - תרגול 6 - 4/12/25
// ניתוב בריאקט
import {Link} from "react-router-dom"; // ספרייה של ריאקט שמאפשרת ניתוב של דף איינטרנט יחיד ולפצלו ל״עמודים״ עם נתיבים שונים

function Navbar() { // הקומפוננטה שאחרית על הצגת התפריט שיביא את היוזר ל״עמודים״ השונים כאשר ילחץ על הלינקים שמקושרים לעמודים השונים על ידי הנתיבים השונים שלהם.
   return (
       <nav // התגית שבה נשים את כל הלינקים שלנו
       >
         <Link to={"/"}>Home Page</Link>
           {/* האלמנט to מחזיק את הנתיב ועל הלינק יופיע הטקסט home page*/}
           {/* הערה: תמיד דף הבית יכיל רק ״/״ בלי כלום אחרי בנתיב כי חייב להכיל משהו אחרי הlocalhost.number אחרת הקישור לא יעבוד - לא נקבל כלום.*/}

       </nav>
   )
}

export default Navbar;